In [113]:
#creat data in csv file and import

import pandas as pd
Holiday = pd.read_csv("Holiday_Destination.csv")

Holiday

   Destination;Feedback Score;Av Star Rating;All Inclusive Hotels ;Most Visited City
0                                  Spain;7;4;60;Ibiza
1                           England;2;3;15;Birmingham
2                           Netherlands;8;5;29;Almere
3                            Tanzania;9;2;18;Zanzibar
4                                Dubai;5;4;25;Atlanta
5                             Jamaica;7;2;12;Kingston
6                                  Japan;6;4;21;Tokyo
7                              Cameroon;8;5;9;Bamenda
8                     South Africa;6;3;35;Johanesburg
9                                 Greece;4;4;47;Corfu
10                            Wakanda;10;5;24;Forever
11                              Malta;6;1;65;Guinness
12                            Maldives;9;4;53;Dwarfty
13                             Portugal;3;3;45;Desert
14                           Morroco;8;2;110;Marakesh

In [109]:
#creat dataset with thesame data

Holiday_Data = {"Destination": ["Spain", "England", "Netherlands", "Tanzania", "Dubai", "Jamaica", "Japan", "Cameroon", "South_Africa", "Greece", "Wakanda", "Malta", "Maldives", "Portugal", "Morroco"], 
          "Feedback": [7,2,8,9,5,7,6,8,6,4,10,6,9,3,8,], 
          "Rating": [4,3,5,2,4,2,4,5,3,4,5,1,4,3,2], 
          "All_Inclusive": [60,15,29,18,25,12,21,9,35,47,24,65,53,45,110], 
          "Popular": ["Ibiza", "Birmingham", "Almere", "Zanzibar", "Atlanta", "Kingston", "Tokyo", "Bamenda", "Johanesburg", "Corfu", "Forever", "Guinness", "Dwarfty", "Desert", "Marakesh"] }
myframe = pd.DataFrame(Holiday_Data)
print(myframe)

     Destination  Feedback  Rating  All_Inclusive      Popular
0          Spain         7       4             60        Ibiza
1        England         2       3             15   Birmingham
2    Netherlands         8       5             29       Almere
3       Tanzania         9       2             18     Zanzibar
4          Dubai         5       4             25      Atlanta
5        Jamaica         7       2             12     Kingston
6          Japan         6       4             21        Tokyo
7       Cameroon         8       5              9      Bamenda
8   South_Africa         6       3             35  Johanesburg
9         Greece         4       4             47        Corfu
10       Wakanda        10       5             24      Forever
11         Malta         6       1             65     Guinness
12      Maldives         9       4             53      Dwarfty
13      Portugal         3       3             45       Desert
14       Morroco         8       2            110     Marakesh

In [110]:
#how many rows and columns in CSV
Holiday.shape

(15, 1)

In [111]:
#how many rows and columns in dataframe
myframe.shape

(15, 5)

In [112]:
#print rows 3 - 8 from csv using iloc/loc
Holiday.iloc[3:8]

  Destination;Feedback Score;Av Star Rating;All Inclusive Hotels ;Most Visited City
3                           Tanzania;9;2;18;Zanzibar
4                               Dubai;5;4;25;Atlanta
5                            Jamaica;7;2;12;Kingston
6                                 Japan;6;4;21;Tokyo
7                             Cameroon;8;5;9;Bamenda

In [100]:
#print rows 3 -8 from dataframe using iloc/loc
myframe.iloc[3:8]

  Destination  Feedback  Rating  All_Inclusive   Popular
3    Tanzania         9       2             18  Zanzibar
4       Dubai         5       4             25   Atlanta
5     Jamaica         7       2             12  Kingston
6       Japan         6       4             21     Tokyo
7    Cameroon         8       5              9   Bamenda

In [102]:
#find the mean number of all inclusive-Inclusive Hotels across destinations.

import numpy as np 
import pandas as pd

myframe["All_Inclusive"] .mean()

37.86666666666667

In [103]:
#Find lowest scoring destination 

myfilter1 = myframe["Feedback"] >9
myfilter1

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11    False
12    False
13    False
14    False
Name: Feedback, dtype: bool

In [104]:
Highestscore = myframe[myfilter1]
Highestscore. head()

   Destination  Feedback  Rating  All_Inclusive  Popular
10     Wakanda        10       5             24  Forever

In [105]:
#Find lowest scoring destination

myfilter2 = myframe["Feedback"]<3
myfilter2. head()

0    False
1     True
2    False
3    False
4    False
Name: Feedback, dtype: bool

In [106]:
Lowestscore = myframe[myfilter2]
Lowestscore. head()

  Destination  Feedback  Rating  All_Inclusive     Popular
1     England         2       3             15  Birmingham

In [107]:
#Find destinations with more than 9 all-inclusive hotels 

myfilter3 = myframe["All_Inclusive"] >9
myfilter3

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8      True
9      True
10     True
11     True
12     True
13     True
14     True
Name: All_Inclusive, dtype: bool

In [108]:
More_Hotels = myframe[myfilter3]
More_Hotels. head()

   Destination  Feedback  Rating  All_Inclusive     Popular
0        Spain         7       4             60       Ibiza
1      England         2       3             15  Birmingham
2  Netherlands         8       5             29      Almere
3     Tanzania         9       2             18    Zanzibar
4        Dubai         5       4             25     Atlanta